fun main()//заглавная функция программы
{// начало программы

    var a = 100 // var - variable - вариативный - изменяемый
    val b = 200 // val - value - значение - константа - неизменяемый
    print("Значение переменной a = ")
    println(a) // вывод на экран с отступом на след строку
    print("Значение переменной b = ")
    println(b)// вывод на экран без отступа на след строку
    a = 25 // меняем значение a c 100 на 25
    print("Значение переменной a после перезаписи = ")
    print(a)


}//конец программы